#include <linux/module.h>
#include <linux/jiffies.h>
#include <linux/i2c.h>
#include <linux/hwmon.h>
#include <linux/hwmon-sysfs.h>
#include <linux/err.h>
#include <linux/mutex.h>
#include <linux/sysfs.h>
#include <linux/slab.h>
#include <linux/init.h>
#include <linux/fs.h>
#include <linux/uaccess.h>
#include <linux/string.h>

#define DRIVER_VERSION  "3.1"

#define TURN_OFF        0
#define TURN_ON         1
#define GET_USB         2
#define GET_LOC         3
#define LOC_OFF         0
#define LOC_BLINK       1
#define ALARM_OFF       0
#define ALARM_AMBER     1
#define ALARM_GREEN     2
#define PSU_1_GOOD      3
#define PSU_2_GOOD      4
#define PCIE_INT        1
#define QSFP_1_INT      2
#define QSFP_2_INT      3
#define FAN_INT         4
#define PSU_INT         5
#define SENSOR_INT      6
#define USB_INT         7
#define USB_ON          0x2
#define USB_OFF         0xfd
#define DIAG_G_ON       0x2
#define DIAG_G_OFF      0xfd
#define LED_ON          0x1
#define LED_OFF         0xfe
#define DIAG_A_ON       0x1
#define DIAG_A_OFF      0xfe
#define LOC_LED_OFF     0x4
#define LOC_LED_BLINK   0xfb

#define SYSFAN_MAX_NUM  5

struct i2c_adap {
	int nr;
	char *name;
	const char *funcs;
	const char *algo;
};

struct i2c_adap *gather_i2c_busses(void);
void free_adapters(struct i2c_adap *adapters);

/* compiler conditional */
#define LED_CTRL_WANTED
#define USB_CTRL_WANTED
#define ASPEED_BMC_WANTED
#define PSU_STAT_WANTED
//#define WDT_CTRL_WANTED
//#define EEPROM_WP_WANTED
//#define I2C_SWITCH_WANTED
//#define EEPROM_WANTED
//#define THEMAL_WANTED
//#define QSFP_WANTED
//#define FAN_CTRL_WANTED
//#define FAN_DUTY_CTRL_WANTED

//#define DEBUG_MSG
#ifdef DEBUG_MSG
    #define debug_print(s) printk s
#else
    #define debug_print(s)
#endif

/* end of compiler conditional */

/* i2c_client Declaration */
static struct i2c_client *ESC_601_i2c_client; //0x30 for other device
static struct i2c_client *Cameo_CPLD_2_client; //0x31 for Port 01-16
static struct i2c_client *Cameo_CPLD_3_client; //0x32 for Port 17-32
static struct i2c_client *Cameo_CPLD_4_client; //0x23 for Fan Status
#ifdef I2C_SWITCH_WANTED
static struct i2c_client *Cameo_Switch_1_client; //0x73
static struct i2c_client *Cameo_Switch_2_client; //0x77
#endif
#ifdef QSFP_WANTED
static struct i2c_client *Cameo_QSFP_Switch_client; //0x74
static struct i2c_client *Cameo_QSFP_client; //0x50
#endif
#ifdef EEPROM_WANTED
static struct i2c_client *Cameo_EEPROM_client; //0x56
#endif
#ifdef THEMAL_WANTED
static struct i2c_client *Cameo_Sensor_client; //0x4c themal sensor
static struct i2c_client *Cameo_MAC_Sensor_client; //0x68 MCP3425
static struct i2c_client *Cameo_Sensor_fan_client; //0x2e themal sensor
#endif
#ifdef ASPEED_BMC_WANTED
static struct i2c_client *Cameo_BMC_client; //0x14 ASPEED BMC
#endif
/* end of i2c_client Declaration */

/* Function Declaration */
/* i2c-0 */
#ifdef EEPROM_WANTED
static ssize_t tlv_status_get(struct device *dev, struct device_attribute *da, char *buf);
#endif
static ssize_t psu_status_get(struct device *dev, struct device_attribute *da, char *buf);
#ifdef PSU_STAT_WANTED
static ssize_t psu_module_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t dc_chip_switch_get(struct device *dev, struct device_attribute *da, char *buf);
#endif
#ifdef USB_CTRL_WANTED
static ssize_t usb_power_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t usb_power_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
#endif
#ifdef LED_CTRL_WANTED
static ssize_t led_ctrl_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t led_ctrl_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
#endif
static ssize_t led_loc_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t led_loc_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
static ssize_t led_alarm_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t led_alarm_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
static ssize_t reset_mac_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
static ssize_t themal_status_get(struct device *dev, struct device_attribute *da, char *buf);
#ifdef THEMAL_WANTED
static ssize_t themal_temp_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t mac_temp_get(struct device *dev, struct device_attribute *da, char *buf);
#endif
static ssize_t themal_mask_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t themal_mask_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
static ssize_t int_status_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t low_power_all_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t low_power_all_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
static ssize_t low_power_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t low_power_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
static ssize_t qsfp_reset_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
static ssize_t qsfp_status_get(struct device *dev, struct device_attribute *da, char *buf);
#ifdef QSFP_WANTED
static ssize_t qsfp_temp_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_date_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_sn_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_pn_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_name_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_oui_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_rev_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_connector_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_encoding_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_nominal_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_ext_rate_com_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_eth_com_code_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_identifier_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_fc_media_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_fc_speed_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t qsfp_cab_tech_get(struct device *dev, struct device_attribute *da, char *buf);
#endif
static ssize_t fan_status_get(struct device *dev, struct device_attribute *da, char *buf);
#ifdef FAN_CTRL_WANTED
static ssize_t fan_mode_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t fan_mode_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
static ssize_t fan_rpm_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t fan_rpm_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
#endif
#ifdef FAN_DUTY_CTRL_WANTED
static ssize_t fan_duty_control(void);
#endif /*FAN_DUTY_CTRL_WANTED*/
#ifdef ASPEED_BMC_WANTED
static ssize_t bmc_register_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t bmc_module_detect(struct device *dev, struct device_attribute *da, char *buf);
#endif
#ifdef WDT_CTRL_WANTED
static ssize_t wdt_status_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t wdt_status_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
#endif
#ifdef EEPROM_WP_WANTED
static ssize_t eeprom_wp_status_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t eeprom_wp_status_set(struct device *dev, struct device_attribute *da, const char *buf, size_t count);
#endif
static ssize_t hw_version_get(struct device *dev, struct device_attribute *da, char *buf);
static ssize_t cpld_version_get(struct device *dev, struct device_attribute *da, char *buf);
/* end of Function Declaration */

/* struct i2c_data */
struct Cameo_i2c_data
{
    struct device      *hwmon_dev;
    struct mutex        update_lock;
    char                valid;          /* !=0 if registers are valid */
    unsigned long       last_updated;   /* In jiffies */
    u8  status;                         /* Status register read from CPLD */
};

#ifdef EEPROM_WANTED
struct qsfp_table {
	int v;
	const char *n;
};

const char * find_value(struct qsfp_table *x, int value);
const char * find_zero_bit(struct qsfp_table *x, int value, int sz);

/**
 *  The TLV Types.
 *
 *  Keep these in sync with tlv_code_list in cmd_sys_eeprom.c
 */
#define TLV_CODE_PRODUCT_NAME   0x21
#define TLV_CODE_PART_NUMBER    0x22
#define TLV_CODE_SERIAL_NUMBER  0x23
#define TLV_CODE_MAC_BASE       0x24
#define TLV_CODE_MANUF_DATE     0x25
#define TLV_CODE_DEVICE_VERSION 0x26
#define TLV_CODE_LABEL_REVISION 0x27
#define TLV_CODE_PLATFORM_NAME  0x28
#define TLV_CODE_ONIE_VERSION   0x29
#define TLV_CODE_MAC_SIZE       0x2A
#define TLV_CODE_MANUF_NAME     0x2B
#define TLV_CODE_MANUF_COUNTRY  0x2C
#define TLV_CODE_VENDOR_NAME    0x2D
#define TLV_CODE_DIAG_VERSION   0x2E
#define TLV_CODE_SERVICE_TAG    0x2F
#define TLV_CODE_VENDOR_EXT     0xFD
#define TLV_CODE_CRC_32         0xFE

/*
 *  Struct for displaying the TLV codes and names.
 */
struct tlv_code_desc {
    u_int8_t m_code;
    char* m_name;
};

/*
 *  List of TLV codes and names.
 */
static const struct tlv_code_desc tlv_code_list[] = {
    { TLV_CODE_PRODUCT_NAME	 , "Product Name"},
    { TLV_CODE_PART_NUMBER	 , "Part Number"},
    { TLV_CODE_SERIAL_NUMBER     , "Serial Number"},
    { TLV_CODE_MAC_BASE	         , "Base MAC Address"},
    { TLV_CODE_MANUF_DATE	 , "Manufacture Date"},
    { TLV_CODE_DEVICE_VERSION    , "Device Version"},
    { TLV_CODE_LABEL_REVISION    , "Label Revision"},
    { TLV_CODE_PLATFORM_NAME     , "Platform Name"},
    { TLV_CODE_ONIE_VERSION	 , "ONIE Version"},
    { TLV_CODE_MAC_SIZE	         , "MAC Addresses"},
    { TLV_CODE_MANUF_NAME	 , "Manufacturer"},
    { TLV_CODE_MANUF_COUNTRY     , "Country Code"},
    { TLV_CODE_VENDOR_NAME	 , "Vendor Name"},
    { TLV_CODE_DIAG_VERSION	 , "Diag Version"},
    { TLV_CODE_SERVICE_TAG       , "Service Tag"},
    { TLV_CODE_VENDOR_EXT	 , "Vendor Extension"},
    { TLV_CODE_CRC_32	         , "CRC-32"},
};

struct __attribute__ ((__packed__)) tlvinfo_header_s {
    char    signature[8];   /* 0x00 - 0x07 EEPROM Tag "TlvInfo" */
    u_int8_t      version;  /* 0x08        Structure version */
    u_int16_t     totallen; /* 0x09 - 0x0A Length of all data which follows */
};
typedef struct tlvinfo_header_s tlvinfo_header_t;

// Header Field Constants
#define TLV_INFO_ID_STRING      "TlvInfo"
#define TLV_INFO_VERSION        0x01

struct __attribute__ ((__packed__)) tlvinfo_tlv_s {
    u_int8_t  type;
    u_int8_t  length;
    u_int8_t  value[0];
};
typedef struct tlvinfo_tlv_s tlvinfo_tlv_t;

/* Maximum length of a TLV value in bytes */
#define TLV_VALUE_MAX_LEN        255
#define TLV_DECODE_VALUE_MAX_LEN    ((5 * TLV_VALUE_MAX_LEN) + 1)

static void decode_tlv_value(tlvinfo_tlv_t * tlv, char* value);
static inline const char* tlv_type2name(u_int8_t type);
static void decode_tlv(tlvinfo_tlv_t * tlv, char *buf);
void show_eeprom(u_int8_t *eeprom, char *buf,int tlv_len);
#endif

#ifdef QSFP_WANTED
/* SFF-8472 Rev. 11.4 table 3.4: Connector values */
static struct qsfp_table conn[] = {
	{ 0x00, "Unknown" },
	{ 0x01, "SC" },
	{ 0x02, "Fibre Channel Style 1 copper" },
